#Тестируем словарь синонимов:

#С помощью unittest необходимо обложить тестами задачу,которую вы так же уже решали - синонимы.


# Заготовка:

class Synonyms(dict):
    def __init__():
        pass

    def add():
        pass

    def count():
        pass

    def check():
        pass


#Охват тестами - все, что считаете нужным. Но не забывайте - это юнит-тестирование.
#Проверка заключается в том, что на вход вашим тестам подается какая-то реализация данной программы с точно такими же
#названиями функций/методов. Задача вашего решения принять верную (тесты завершатся OK), и отвергнуть неверную (FAILED).
#Тесты работают хорошо, если они в состоянии принять верную реализацию и отвергают неверные.

