#Необязательное задание:

#Есть матрица NxN, содержит в себе элементы (целые числа, для простоты) 
# Мы представили ее как N строк а затем как N столбцов. 
# Теперь, у нас в «мешке» лежит 2N векторов, каждый из которых длин N. 
# Задача: восстановить исходную матрицу с точностью до некоторых транспонирований. 
# Код должен хорошо масштабироваться, т.е. хотим запускать на размерах от 2х2 до 100х100 и содержать юнит-тесты, 
# показывающий, что матрицы совпадают (с точностью до транспонирований).

#Язык программирования: Python, C++, Rust, Golang - на выбор любой.